
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/yuta051214/aws-ecs-terraform/actions/runs/5120173789)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0fb7fc86204155dce]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06656c5c3602f0f5d]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0a9f7eb7fcf5eb315]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0054216335c294644]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083a026f63d526c5d]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0732e30fca26370d6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-029491a8a902647c7]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-045aeb3b5dc72c33c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0fe40e4127bd7e683]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f745594c0f320817]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-087a561778d6e5a55]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08601bb7dbcd97701]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0667f822c116447c0]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-05bf2ce5441b4724d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-029491a8a902647c71080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a60610289f274ed7]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-020fb839e900f77d5]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d73844da0ac85ea8]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-060e5a31b77fe85c1]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-06a6592ae719519e0]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0f1336eac8f68336b]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0fe40e4127bd7e6831080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f745594c0f3208171080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-06656c5c3602f0f5d"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-06656c5c3602f0f5d"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-01ac9694e73ce7907]
aws_security_group.alb: Creation complete after 4s [id=sg-05c7fc4678898ca54]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-1805189038]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"6f39bf42c363fae650ae441b0232aefbe1648841","Vars":{},"WorkflowName":"Terraform"} -->